In [69]:
import pandas as pd

df=pd.read_excel('1.xlsx',sheet_name='Sheet1')

df

      Name  Age         City  Pincode
0     Tony   29          USA     5423
1     Thor   25       Asgard     1236
2  Natasha   19          USA     5468
3     Bush   30          USA     4569
4  Tichala   28      Wakanda     2365
5   Naruto   26  Hidden Leaf     5621
6     Goku   18  Mount Paccu     5632
7      Guy   22        Korea     1236

In [70]:
df=pd.read_csv('1.csv')

df

      Name  Age         City  Pincode
0     Tony   29          USA     5423
1     Thor   25       Asgard     1236
2  Natasha   19          USA     5468
3     Bush   30          USA     4569
4  Tichala   28      Wakanda     2365
5   Naruto   26  Hidden Leaf     5621
6     Goku   18  Mount Paccu     5632
7      Guy   22        Korea     1236

In [71]:

df.describe()

             Age      Pincode
count   8.000000     8.000000
mean   24.625000  3943.750000
std     4.533605  1990.049658
min    18.000000  1236.000000
25%    21.250000  2082.750000
50%    25.500000  4996.000000
75%    28.250000  5506.250000
max    30.000000  5632.000000

In [72]:
df.head()

      Name  Age     City  Pincode
0     Tony   29      USA     5423
1     Thor   25   Asgard     1236
2  Natasha   19      USA     5468
3     Bush   30      USA     4569
4  Tichala   28  Wakanda     2365

In [73]:
df.tail()

      Name  Age         City  Pincode
3     Bush   30          USA     4569
4  Tichala   28      Wakanda     2365
5   Naruto   26  Hidden Leaf     5621
6     Goku   18  Mount Paccu     5632
7      Guy   22        Korea     1236

In [74]:
df.index=["First","Second","Third","Fourth","fifth","sixth","seventh","eight"]

df

            Name  Age         City  Pincode
First       Tony   29          USA     5423
Second      Thor   25       Asgard     1236
Third    Natasha   19          USA     5468
Fourth      Bush   30          USA     4569
fifth    Tichala   28      Wakanda     2365
sixth     Naruto   26  Hidden Leaf     5621
seventh     Goku   18  Mount Paccu     5632
eight        Guy   22        Korea     1236

In [75]:
df.columns

Index(['Name', 'Age', 'City', 'Pincode'], dtype='object')

In [76]:


df['Age']

First      29
Second     25
Third      19
Fourth     30
fifth      28
sixth      26
seventh    18
eight      22
Name: Age, dtype: int64

In [77]:
df.Name

First         Tony
Second        Thor
Third      Natasha
Fourth        Bush
fifth      Tichala
sixth       Naruto
seventh       Goku
eight          Guy
Name: Name, dtype: object

In [78]:
type(df)

pandas.core.frame.DataFrame

In [79]:
df[["Pincode","Name"]]

         Pincode     Name
First       5423     Tony
Second      1236     Thor
Third       5468  Natasha
Fourth      4569     Bush
fifth       2365  Tichala
sixth       5621   Naruto
seventh     5632     Goku
eight       1236      Guy

In [80]:
df["Age"].max()

np.int64(30)

In [81]:
df["Age"].mean()

np.float64(24.625)

In [82]:
df["Age"].min()

np.int64(18)

In [83]:
df.index

Index(['First', 'Second', 'Third', 'Fourth', 'fifth', 'sixth', 'seventh',
       'eight'],
      dtype='object')

In [84]:
df.set_index("Name",inplace=True)